---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PlacementRight
source: html/1012c35f-0322-71db-346c-31f8ef874e0a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PlacementRight Property

"Right"

## Syntax (C#)
```csharp
public static ForgeTypeId PlacementRight { get; }
```